Revit 2027 API
Toposolid.SetSmoothedSurface Method
 Sets smoothed surface setting of Toposolid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void SetSmoothedSurface(
	Document document,
	bool enable
)
Public Shared Sub SetSmoothedSurface (
	document As Document,
	enable As Boolean
)
public:
static void SetSmoothedSurface(
	Document^ document,
	bool enable
)
static member SetSmoothedSurface :
        document : Document *
        enable : bool -> unit
Parameters
document Document
 The document.
enable Boolean
 True means enable smoothed surface setting, otherwise disable.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Toposolid Class
Autodesk.Revit.DB Namespace